ИТ_Фирма/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧаса</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИнформационнойБазы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИТ_Фирма/src/Catalogs/Сотрудники/Forms/ФормаАдминистратора/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если Пользователь = Неопределено 
		
		И  ВходРазрешен 
		И ЗначениеЗаполнено(ИмяПользователя) Тогда
		
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.АутентификацияОС = ВходРазрешен;
		НовыйПользователь.Имя = ИмяПользователя;
		НовыйПользователь.ПолноеИмя = ТекущийОбъект.Наименование;
		НовыйПользователь.Пароль = Пароль;
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		НовыйПользователь.Записать();
		
		ТекущийОбъект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
		
	ИначеЕсли Пользователь <> Неопределено Тогда 
		
		Пользователь.Имя = ИмяПользователя;
		Пользователь.ПолноеИмя = ТекущийОбъект.Наименование;
		Если Пароль <> "Установлен" Тогда
			Пользователь.Пароль = Пароль;
		КонецЕсли;	
		Пользователь.Пароль = Пароль;
		Пользователь.АутентификацияОС = ВходРазрешен;
		Пользователь.Записать();
	КонецЕсли;	
	
	// Получение фотографии
	Если ЗначениеЗаполнено(АдресФото) Тогда
		ДвДанныеФотографии = ПолучитьИзВременногоХранилища(АдресФото);
		ДанныеВХранилище = Новый ХранилищеЗначения(ДвДанныеФотографии);
		ТекущийОбъект.Фотография = ДанныеВХранилище;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
		
		Если Пользователь <> Неопределено Тогда
			
			ИмяПользователя = Пользователь.Имя;
			Если Пользователь.ПарольУстановлен Тогда 
				Пароль = "Установлен";
			КонецЕсли;
			ВходРазрешен = Пользователь.АутентификацияСтандартная;
			
		ИначеЕсли Пользователь = Неопределено Тогда
			ИмяПользователя = "";
			Пароль = "";
			ВходРазрешен = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	// Получение фотографии
	
	ДвоичныеДанныеФотографии = ТекущийОбъект.Фотография.Получить();
	АдресФото = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФотографии, УникальныйИдентификатор);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УволенПриИзменении(Элемент)
	
	Если Объект.Уволен = Истина Тогда 
		
		Элементы.ДатаУвольнения.Видимость = Истина;
	Иначе 
		
		Элементы.ДатаУвольнения.Видимость = Ложь;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Уволен = Ложь Тогда
		Элементы.ДатаУвольнения.Видимость = Ложь;
	Иначе
		Элементы.ДатаУвольнения.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьПароль(Команда)
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	НовыйПароль = Новый Массив;
	
	Для Сч = 0 по 2 Цикл	
		ЦифраПароля =ГСЧ.СлучайноеЧисло(0,9); 
		НовыйПароль.Добавить(ЦифраПароля);
		СимволЗаглавнойБуквы = Символ(ГСЧ.СлучайноеЧисло(65,90));
		НовыйПароль.Добавить(СимволЗаглавнойБуквы);
		СимволСтрочнойБуквы = Символ(ГСЧ.СлучайноеЧисло(97,122));
		НовыйПароль.Добавить(СимволСтрочнойБуквы);
	КонецЦикла;	
	СлучайныйПароль = СтрСоединить(НовыйПароль,"")	
КонецПроцедуры

&НаКлиенте
Процедура АдресФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьФайлФотоАсинх();
	
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ВыбратьФайлФотоАсинх()
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите фотографию";
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Фильтр = "Картинки |*.jpg; *.png";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога, УникальныйИдентификатор);
	
	Если ОписаниеФайла = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	АдресФото = ОписаниеФайла.Адрес;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	
	АдресРезультата = ПодготовитьКартинку(АдресФото, УникальныйИдентификатор);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьКартинку(АдресФото, УникальныйИдентификатор)

 	ДВДанныйИзображения = ПолучитьИзВременногоХранилища(АдресФото);
	
	Если ДВДанныйИзображения = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Фотография не добавлена";
		Сообщение.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	Картинка = Новый Картинка(ДВДанныйИзображения);
	
	Если Картинка.Ширина() = 100 Тогда 
		Возврат АдресФото;
	КонецЕсли;
	
	ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
	
	ОбрабатываемаяКартинка.УстановитьРазмер(100, Неопределено);
	
	ДВДанныйИзображения = Картинка.ПолучитьДвоичныеДанные();
	
	АдресОбработаннойКартинки = ПоместитьВоВременноеХранилище(ДВДанныйИзображения, УникальныйИдентификатор);
	
	Возврат АдресОбработаннойКартинки;



КонецФункции
